IDEA StatiCa Open Model
Material.StateOfThermalStressStrain Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 State of thermal specific stress-strain curvature
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ThermalStressStrainState StateOfThermalStressStrain { get; set; }
Public Property StateOfThermalStressStrain As ThermalStressStrainState
	Get
	Set
public:
property ThermalStressStrainState StateOfThermalStressStrain {
	ThermalStressStrainState get ();
	void set (ThermalStressStrainState value);
}
Property Value
Type: ThermalStressStrainState
See Also
Reference
Material Class
IdeaRS.OpenModel.Material Namespace